app/Controllers/Home.php

SELECT *
FROM `automoveis`
---
    public function telinha():string
    {

        $my_model = new AutomoveisModel();
        $result = $my_model->findAll();

INSERT INTO `automoveis` (`marca`, `modelo`, `km`, `ano`, `preco`) VALUES ('Nissan', 'Versa', '0', '2023', '56700')
---
    public function receiveData()
    {
        $data = array(
            'marca' => $this->request->getVar('marca'),
            'modelo' => $this->request->getVar('modelo'),
            'km'=> $this->request->getVar('km'),
            'ano'=> $this->request->getVar('ano'),
            'preco' => $this->request->getVar('preco')
        );

        //print_r($data);

        $my_model = new AutomoveisModel();
        $my_model->insert($data);

DELETE FROM `automoveis`
WHERE `id` IN ('10')
---
    public function deletarItem()
    {
        $id = $this->request->getVar('id');
        $my_model = new AutomoveisModel();
        $my_model->delete($id);

SELECT *
FROM `automoveis`
WHERE `automoveis`.`id` = '15'
---
    public function editarItem(){

        $my_model = new AutomoveisModel();
        $id_var = $this->request->getVar('id');
        $result = $my_model->find($id_var);

SELECT *
FROM `automoveis`
WHERE `modelo` LIKE '%ver%' ESCAPE '!'
---
    public function pesquisar(){
        $mysearch = $this->request->getVar("pesquisa");


        $db      = \Config\Database::connect();
        $builder = $db->table('automoveis');


        $result = $builder->like('modelo', $mysearch)->get()->getResult('array');